In [2]:
import numpy as np   # numerical computations
import pandas as pd    #dataframes and spreadsheets
pd.set_option('display.max_columns', 22)


import matplotlib.pyplot as plt      # visualisations and charts


from sqlalchemy import create_engine

In [5]:
# pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.1.0-py2.py3-none-any.whl (581 kB)
     |████████████████████████████████| 581 kB 4.3 MB/s eta 0:00:01
Collecting protobuf<=4.21.12,>=4.21.1
  Downloading protobuf-4.21.12-cp37-abi3-macosx_10_9_universal2.whl (486 kB)
     |████████████████████████████████| 486 kB 8.6 MB/s eta 0:00:01
Installing collected packages: protobuf, mysql-connector-python
  Attempting uninstall: protobuf
    Found existing installation: protobuf 3.19.1
    Uninstalling protobuf-3.19.1:
      Successfully uninstalled protobuf-3.19.1
Successfully installed mysql-connector-python-8.1.0 protobuf-4.21.12
Note: you may need to restart the kernel to use updated packages.

In [6]:
def get_table_sql(query):

    host="relational.fit.cvut.cz"
    user="guest"
    password="relational"

    connection_string_mysql = f"mysql+mysqlconnector://{user}:{password}@{host}"
    
    with create_engine(connection_string_mysql).connect() as connection:
        
        df = pd.read_sql_query(query, con=connection)
    
    return df

In [7]:
loan = get_table_sql('''SELECT * FROM financial.loan;''')
acct = get_table_sql('''SELECT * FROM financial.account;''')
client = get_table_sql('''SELECT * FROM financial.client;''')
trans = get_table_sql('''SELECT * FROM financial.trans;''')

In [8]:
loan

     loan_id  account_id        date  amount  duration  payments status
0       4959           2  1994-01-05   80952        24    3373.0      A
1       4961          19  1996-04-29   30276        12    2523.0      B
2       4962          25  1997-12-08   30276        12    2523.0      A
3       4967          37  1998-10-14  318480        60    5308.0      D
4       4968          38  1998-04-19  110736        48    2307.0      C
..       ...         ...         ...     ...       ...       ...    ...
677     7294       11327  1998-09-27   39168        24    1632.0      C
678     7295       11328  1998-07-18  280440        60    4674.0      C
679     7304       11349  1995-10-29  419880        60    6998.0      C
680     7305       11359  1996-08-06   54024        12    4502.0      A
681     7308       11362  1996-12-27  129408        24    5392.0      A

[682 rows x 7 columns]

In [ ]:
# EDA for loan, client( create age column), merge all relevant cells together in to one DF. Preprocess the data
# trans (collapse to unique account ID/loan ID) and merge to one DF.